"""
Να κατασκευάσετε συνάρτηση initials(text) που δέχεται ως είσοδο ένα κείμενο και επιστρέφει το κείμενο με το αρχικό μόνο 
σύμβολο κάθε λέξης του έχοντας μετατραπεί σε κεφαλαίο, π.χ. αν text = Καλημέρα σας κυρίες και κύριοι, επιστρέφει:
Κ. Σ. Κ. Κ. Κ.
Προσοχή, μετά την κάθε τελεία υπάρχει κενό ανάμεσα στους χαρακτήρες, αν το αποτέλεσμά σας δεν περιέχει αυτά τα κενά θα θεωρηθεί λάθος!
"""

def initials(text):
    tmpString = text.split(" ")
    returnedTxt = ""
    for word in tmpString:
        returnedTxt += word[:1].upper() + ". "
    return returnedTxt[:len(returnedTxt)-1]




